

// adkarsl2.swift

import Foundation

/// مصفوفة الأذكار الخاصة بالحالة adkarsl2
let adkarsl2List: [Dhikr] = [
    Dhikr(text: """
        «الْحَمْدُ للَّهِ الَّذِي كَسَانِي هَذَا الثَّوْبَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلاَ قُوَّة»
        """,
          repetition: 1,
          note: "أخرجه أهل السنن إلا النسائي: أبو داود، برقم ٤٠٢٣، والترمذي، برقم ٣٤٥٨، وابن ماجه، برقم ٣٢٨٥، وحسنه الألباني في: إرواء الغليل، ٧/ ٤٧.")
]

let adkarsl3List: [Dhikr] = [
    Dhikr(text: """
        «اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ»
        """,
          repetition: 1,
          note: "أبو داود، برقم ٤٠٢٠، والترمذي، برقم ١٧٦٧، والبغوي، ١٢/ ٤٠، وانظر: مختصر شمائل الترمذي للألباني، ص٤٧.")
]

let adkarsl4List: [Dhikr] = [
    Dhikr(text: """
        «بِسْمِ اللَّهِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبائِث»
        """,
          repetition: 1,
          note: "أخرجه البخاري، ١/ ٤٥، برقم ١٤٢، ومسلم، ١/ ٢٨٣، برقم ٣٧٥، وزيادة: «بسم الله» في أوله أخرجها سعيد بن منصور. انظر فتح الباري ١/ ٢٤٤.")
]

let adkarsl5List: [Dhikr] = [
    Dhikr(text: """
        «غُفْرَانَكَ»
        """,
          repetition: 1,
          note: "أخرجه أصحاب السنن إلا النسائي فأخرجه في عمل اليوم والليلة، برقم ٧٩، أبو داود، برقم ٣٠، والترمذي، برقم ٧، وابن ماجه، برقم ٣٠٠، وصححه الألباني في صحيح سنن أبي داود، ١/ ١٩.")
]

let adkarsl6List: [Dhikr] = [
    Dhikr(text: """
                اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا،
        وَفِي لِسَانِي نُورًا،
        وَفِي سَمْعِي نُورًا،
        وَفِي بَصَرِي نُورًا،
        وَمِنْ فَوْقِي نُورًا،
        وَمِنْ تَحْتِي نُورًا،
        وَعَنْ يَمِينِي نُورًا،
        وَعَنْ شِمَالِي نُورًا،
        وَمِنْ أَمَامِي نُورًا،
        وَمِنْ خَلْفِي نُورًا،
        وَاجْعَلْ فِي نَفْسِي نُورًا،
        وَأَعْظِمْ لِي نُورًا،
        وَعَظِّم لِي نُورًا،
        وَاجْعَلْ لِي نُورًا،
        وَاجْعَلْنِي نُورًا،
        اللَّهُمَّ أَعْطِنِي نُورًا،
        وَاجْعَلْ فِي عَصَبِي نُورًا،
        وَفِي لَحْمِي نُورًا،
        وَفِي دَمِي نُورًا،
        وَفِي شَعْرِي نُورًا،
        وَفِي بَشَرِي نُورًا،
        اللَّهُمَّ اجْعَلْ لِي نُورًا فِي قَبْرِي،
        وَنُورًا فِي عِظَامِي،
        وَزِدْنِي نُورًا،
        وَزِدْنِي نُورًا،
        وَزِدْنِي نُورًا،
        وَهَبْ لِي نُورًا عَلَى نُورٍ
        """,
          repetition: 1,
          note: "انظر جميع هذه الألفاظ في البخاري، ١١/ ١١٦، برقم ٦٣١٦، ومسلم، ١/ ٥٢٦، و٥٢٩، و٥٣٠، برقم ٧٦٣.")
]

let adkarsl7List: [Dhikr] = [
    Dhikr(text: """
        «يَبْدَأُ بِرِجْلِهِ الْيُمْنَى، وَيَقُولُ: أَعُوذُ بِاللَّهِ العَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ. بِسْمِ اللَّهِ، وَالصَّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ. اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ»
        """,
          repetition: 1,
          note: "لقول أنس بن مالك رَضِيَ اللهُ عَنه: «من السنة إذ دخلت المسجد أن تَبدأ برجلك اليمنى، وإذا خرجت أن تبدأ برجلك اليسرى»، أخرجه الحاكم، ١/ ٢١٨، وصححه على شرط مسلم، ووافقه الذهبي، وأخرجه البيهقي، ٢/ ٤٤٢، وحسنه الألباني في سلسلة الأحاديث الصحيحة، ٥/ ٦٢٤، برقم ٢٤٧٨.")
]

let adkarsl8List: [Dhikr] = [
    Dhikr(text: """
        «يَبْدَأُ بِرِجْلِهِ الْيُسْرَى، وَيَقُولُ: بِسْمِ اللَّهِ وَالصّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِك، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ»
        """,
          repetition: 1,
          note: "الحاكم، ١/ ٢١٨، والبيهقي، ٢/ ٤٤٢، وحسنه الألباني في سلسلة الأحاديث الصحيحة، ٥/ ٦٢٤، برقم ٢٤٧٨، وتقدم تخريجه.")
]

let adkarsl9List: [Dhikr] = [
    Dhikr(
        text: """
        اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ
        """,
        repetition: 1,
        note: """
        البخاري، ١/ ١٨١، برقم ٧٤٤، ومسلم، ١/ ٤١٩، برقم ٥٩٨.
        """
    )
]

let adkarsl10List: [Dhikr] = [
    Dhikr(
        text: """
        سُبْحَانَ رَبِّيَ الْعَظِيمِ
        """,
        repetition: 1,
        note: """
        أخرجه أهل السنن، وأحمد: أبو داود، برقم ٨٧٠، والترمذي، برقم ٢٦٢، والنسائي، برقم ١٠٠٧، وابن ماجه، برقم ٨٩٧، وأحمد، برقم ٣٥١٤، انظر: صحيح الترمذي، ١/ ٨٣.
        """
    ),
    Dhikr(
        text: """
        سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي
        """,
        repetition: 1,
        note: """
        البخاري، ١/ ٩٩، برقم ٧٩٤، ومسلم، ١/ ٣٥٠، برقم ٤٨٤.
        """
    ),
    Dhikr(
        text: """
        سُبُّوُحٌ، قُدُّوسٌ، رَبُّ الْمَلَائِكَةِ وَالرُّوحِ
        """,
        repetition: 1,
        note: """
        مسلم، ١/ ٣٥٣، برقم ٤٨٧، وأبو داود، برقم ٨٧٢.
        """
    ),
    Dhikr(
        text: """
        اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، خَشَعَ لَكَ سَمْعِي، وَبَصَرِي، وَمُخِّي، وَعَظْمِي، وَعَصَبِي، وَمَا استَقَلَّتْ بِهِ قَدَمِي
        """,
        repetition: 1,
        note: """
        مسلم، ١/ ٥٣٤، برقم ٧٧١، وأبو داود، برقم ٧٦٠–٧٦١، والترمذي، برقم ٣٤٢١، والنسائي، برقم ١٠٤٩، ابن خزيمة برقم ٦٠٧، وابن حبان برقم ١٩٠١.
        """
    ),
    Dhikr(
        text: """
        سُبْحَانَ ذِي الْجَبَرُوتِ، وَالْمَلَكُوتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ
        """,
        repetition: 1,
        note: """
        أبو داود، ١/ ٢٣٠، برقم ٨٧٣، والنسائي، برقم ١١٣١، وأحمد، برقم ٢٣٩٨٠، وإسناده حسن.
        """
    )
]

let adkarsl11List: [Dhikr] = [
    Dhikr(
        text: """
        «سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ»
        """,
        repetition: 1,
        note: """
        البخاري مع الفتح، ٢/ ٢٨٢، برقم ٧٩٦.
        """
    ),
    Dhikr(
        text: """
        «رَبَّنَا وَلَكَ الْحَمْدُ، حَمْدًا كَثيرًا طَيِّبًا مُبارَكًا فِيهِ»
        """,
        repetition: 1,
        note: """
        البخاري مع الفتح، ٢/ ٢٨٤، برقم ٧٩٦.
        """
    ),
    Dhikr(
        text: """
        «مِلْءَ السَّمَاوَاتِ وَمِلْءَ الأَرْضِ، وَمَا بَيْنَهُمَا، وَمِلْءَ مَا شِئْتَ مِنْ شَيءٍ بَعْدُ. أَهلَ الثَّناءِ وَالْمَجْدِ، أَحَقُّ مَا قَالَ الْعَبْدُ، وَكُلُّنَا لَكَ عَبْدٌ. اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَدُّ»
        """,
        repetition: 1,
        note: """
        مسلم، ١/ ٣٤٦، برقم ٤٧٧.
        """
    )
]

let adkarsl12List: [Dhikr] = [
    Dhikr(
        text: """
        «سُبْحَانَ رَبِّيَ الأَعْلَى»
        """,
        repetition: 1,
        note: """
        أخرجه أهل السنن، وأحمد: أبو داود، برقم ٨٧٠، والترمذي، برقم ٢٦٢، والنسائي، برقم ١٠٠٧، وابن ماجه، برقم ٨٩٧، وأحمد، برقم ٣٥١٤، انظر: صحيح الترمذي، ١/ ٨٣.
        """
    ),
    Dhikr(
        text: """
        «سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي»
        """,
        repetition: 1,
        note: """
        البخاري، برقم ٧٩٤، ومسلم، برقم ٤٨٤، وتقدم برقم ٣٤.
        """
    ),
    Dhikr(
        text: """
        «سُبوحٌ، قُدُّوسٌ، رَبُّ الْمَلَائِكَةِ وَالرُّوحِ»
        """,
        repetition: 1,
        note: """
        مسلم، ١/ ٥٣٣، برقم ٤٨٧، وأبو داود، برقم ٨٧٢، وتقدم برقم ٣٥.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ لَكَ سَجَدْتُ وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، سَجَدَ وَجْهِيَ لِلَّذِي خَلَقَهُ، وَصَوَّرَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ»
        """,
        repetition: 1,
        note: """
        مسلم، ١/ ٥٣٤، برقم ٧٧١، وغيره.
        """
    ),
    Dhikr(
        text: """
        «سُبْحَانَ ذِي الْجَبَرُوتِ، وَالْمَلَكُوتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ»
        """,
        repetition: 1,
        note: """
        أبو داود، ١/ ٢٣٠، برقم ٨٧٣، والنسائي، برقم ١١٣١، وأحمد، برقم ٢٣٩٨٠، وصححه الألباني في صحيح أبي داود، ١/ ١٦٦، وتقدم تخريجه برقم ٣٧.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ: دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلاَنِيَّتَهُ وَسِرَّهُ»
        """,
        repetition: 1,
        note: """
        مسلم، ١/ ٢٣٠، برقم ٤٨٣.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ، لاَ أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ»
        """,
        repetition: 1,
        note: """
        مسلم، ١/ ٣٥٢، برقم ٤٨٦.
        """
    )
]

let adkarsl13List: [Dhikr] = [
    Dhikr(
        text: """
        «رَبِّ اغْفِرْ لِي، رَبِّ اغْفِرْ لِي»
        """,
        repetition: 1,
        note: """
        أبو داود، ١/ ٢٣١، برقم ٨٧٤، وابن ماجه، برقم ٨٩٧، وانظر: صحيح ابن ماجه، ١/ ١٤٨.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَاجْبُرْنِي، وَعَافِنِي، وَارْزُقْنِي، وَارْفَعْنِي»
        """,
        repetition: 1,
        note: """
        أخرجه أصحاب السنن إلا النسائي: أبو داود، ١/ ٢٣١، برقم ٨٥٠، والترمذي، برقم ٢٨٤ و٢٨٥، وابن ماجه، برقم ٨٩٨، وانظر: صحيح الترمذي، ١/ ٩٠، وصحيح ابن ماجه، ١/ ١٤٨.
        """
    )
]

let adkarsl14List: [Dhikr] = [
    Dhikr(
        text: """
        «سَجَدَ وَجْهِيَ لِلَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ بِحَوْلِهِ وَقُوَّتِهِ، فَتَبارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ»
        """,
        repetition: 1,
        note: """
        الترمذي، ٢/ ٤٧٤، برقم ٣٤٢٥، وأحمد، ٦/ ٣٠، برقم ٢٤٠٢٢، والحاكم وصححه ووافقه الذهبي، ١/ ٢٢٠، والآية رقم ١٤ من سورة المؤمنون.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أَجْرًا، وَضَعْ عَنِّي بِهَا وِزْرًا، وَاجْعَلْهَا لِي عِنْدَكَ ذُخْرًا، وَتَقَبَّلْهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ»
        """,
        repetition: 1,
        note: """
        الترمذي، ٢/ ٤٧٣، برقم ٥٧٩، والحاكم وصححه ووافقه الذهبي، ١/ ٢١٩.
        """
    )
]

let adkarsl15List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ»
        """,
        repetition: 1,
        note: """
        البخاري، ٢/ ١٠٢، برقم ١٣٧٧، ومسلم، ١/ ٤١٢، برقم ٥٨٨، واللفظ لمسلم.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ إِنِّي أَعوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ. اللَّهُمَّ إِنِّي أَعوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ»
        """,
        repetition: 1,
        note: """
        البخاري، ١/ ٢٠٢، برقم ٨٣٢، ومسلم، ١/ ٤١٢، برقم ٥٨٧.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي، إِنَّكَ أَنْتَ الغَفورُ الرَّحيمُ»
        """,
        repetition: 1,
        note: """
        البخاري، ٨/ ١٦٨، برقم ٨٣٤، ومسلم، ٤/ ٢٠٧٨، برقم ٢٧٠٥.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، وَمَا أَسْرَفْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي. أَنْتَ الْمُقَدِّمُ، وَأَنْتَ الْمُؤَخِّرُ لاَ إِلَهَ إِلاَّ أَنْتَ»
        """,
        repetition: 1,
        note: """
        مسلم، ١/ ٥٣٤، برقم ٧٧١.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبادَتِكَ»
        """,
        repetition: 1,
        note: """
        أبو داود، ٢/ ٨٦، برقم ١٥٢٢، والنسائي، ٣/ ٥٣، برقم ٢٣٠٢، وصححه الألباني في صحيح أبي داود، ١/ ٢٨٤.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، وَأَعوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا وَعَذَابِ الْقَبْرِ»
        """,
        repetition: 1,
        note: """
        البخاري مع الفتح، ٦/ ٣٥، برقم ٢٨٢٢، ورقم ٦٣٩٠.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ»
        """,
        repetition: 1,
        note: """
        أبو داود، برقم ٧٩٢، وابن ماجه، برقم ٩١٠، وانظر: صحيح ابن ماجه، ٢/ ٣٢٨.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ بِعِلْمِكَ الغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلقِ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْغِنَى وَالْفَقْرِ، وَأَسْأَلُكَ نَعِيمًا لاَ يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لاَ تَنْقَطِعُ، وَأَسْأَلُكَ الرِّضَا بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقائِكَ فِي غَيرِ ضَرَّاءَ مُضِرَّةٍ، وَلاَ فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَا بِزِينَةِ الإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ»
        """,
        repetition: 1,
        note: """
        النسائي، ٣/ ٥٤-٥٥، برقم ١٣٠٤، وأحمد، ٤/ ٣٦٤، برقم ٢١٦٦٦، وصححه الألباني في صحيح النسائي، ١/ ٢٨١.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا أَللَّهُ بِأَنَّكَ الْوَاحِدُ الْأَحَدُ الصَّמَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُوبِي إِنَّكَ أَنتَ الْغَفُورُ الرَحِيمُ»
        """,
        repetition: 1,
        note: """
        أخرجه النسائي، ٣/ ٥٢، برقم ١٣٠٠ بلفظه، وأحمد، ٤/ ٣٣٨، برقم ١٨٩٧٤، وصححه الألباني في صحيح النسائي، ١/ ٢٨٠.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، الْمَنَّانُ، يَا بَدِيعَ السَّمَوَاتِ وَالْأَرْضِ، يَا ذَا الْجَلاَلِ وَالْإِكْرَامِ، يَا حَيُّ يَا قَيُّومُ، إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ»
        """,
        repetition: 1,
        note: """
        رواه أبو داود، برقم ١٤٩٥، والترمذي، برقم ٣٥٤٤، وابن ماجه، برقم ٣٨٥٨، والنسائي، برقم ١٢٩٩، وانظر: صحيح ابن ماجه، ٢/ ٣٢٩.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لاَ إِلَهَ إِلاَّ أَنْتَ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ»
        """,
        repetition: 1,
        note: """
        أبو داود، ٢/ ٦٢، برقم ١٤٩٣، والترمذي، ٥/ ٥١٥، برقم ٣٤٧٥، وابن ماجه، ٢/ ١٢٦٧، برقم ٣٨٥٧، والنسائي، برقم ١٣٠٠ بلفظه، وأحمد، برقم ١٨٩٧٤، وصححه الألباني في صحيح النسائي، ١/ ٢٨٠.
        """
    )
]

let adkarsl16List: [Dhikr] = [
    Dhikr(
        text: """
        قَالَ جَابرُ بْنُ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُمَا: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُنَا الاسْتِخَارَةَ فِي الْأُمُورِ كُلِّهَا كَمَا يُعَلِّمُنَا السُّورَةَ مِنَ الْقُرْآنِ. يَقُولُ: إِذَا هَمَّ أَحَدُكُمْ بِالْأَمْرِ فَلْيَرْكَعْ رَكْعَتَيْنِ مِنْ غَيْرِ الْفَرِيضَةِ، ثُمَّ لْيَقُلْ: اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ؛ فَإِنَّكَ تَقْدِرُ وَلاَ أَقْدِرُ، وَتَعْلَمُ وَلاَ أَعْلَمُ، وَأَنْتَ عَلَّامُ الْغُيُوبِ. اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي - أَوْ قَالَ: عَاجِلِهِ وَآجِلِهِ - فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ. وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي - أَوْ قَالَ: عَاجِلِهِ وَآجِلِهِ - فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ، ثُمَّ أَرْضِنِي بِهِ. وَمَا نَدِمَ مَنِ اسْتَخَارَ الْخَالِقَ وَشَاوَرَ الْمَخْلُوقِينَ الْمُؤْمِنِينَ وَتَثَبَّتَ فِي أَمْرِهِ، فَقَدْ قَالَ اللَّهُ سُبْحَانَهُ وَتَعَالَى: {وَشَاوِرْهُمْ فِي الأَمْرِ فَإِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللَّهِ}
        """,
        repetition: 1,
        note: """
        البخاري، ٧/١٦٢، برقم ١١٦٢.  
        سورة آل عمران، الآية: ١٥٩.
        """
    )
]

let adkarsl17List: [Dhikr] = [
    Dhikr(
        text: """
        لاَ إِلَهَ إِلاَّ اللَّهُ الْوَاحِدُ الْقَهّارُ، رَبُّ السَّمَوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الْعَزيزُ الْغَفَّارُ
        """,
        repetition: 1,
        note: """
        يقول ذلك إذا تقلب من جنب إلى جنب في الليل.  
        أخرجه الحاكم، وصححه ووافقه الذهبي، ١/ ٥٤٠، والنسائي في عمل اليوم والليلة، برقم ٢٠٢، وابن السني، برقم ٧٥٧، انظر: صحيح الجامع ٤/ ٢١٣.
        """
    )
]

let adkarsl18List: [Dhikr] = [
    Dhikr(
        text: """
        أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّياطِينِ وَأَنْ يَحْضُرُونِ
        """,
        repetition: 1,
        note: """
        أبو داود، ٤/ ١٢، برقم ٣٨٩٣، والترمذي، برقم ٣٥٢٨، انظر: صحيح الترمذي، ٣/ ١٧١.
        """
    )
]

let adkarsl19List: [Dhikr] = [
    Dhikr(
        text: """
        اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ، وَعَافِنِي فِيمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ؛ فَإِنَّكَ تَقْضِي وَلاَ يُقْضَى عَلَيْكَ، إِنَّهُ لاَ يَذِلُّ مَنْ وَالَيْتَ، [وَلاَ يَعِزُّ مَنْ عَادَيْتَ]، تَبارَكْتَ رَبَّنَا وَتَعَالَيْتَ
        """,
        repetition: 1,
        note: """
        أخرجه أصحاب السنن الأربعة، وأحمد، والدارمي، والبيهقي: أبو داود برقم ١٤٢٥، والترمذي رقم ٤٦٤، والنسائي رقم ١٧٤٤، وابن ماجه رقم ١١٧٨، وأحمد رقم ١٧١٨، الحاكم ٣/ ١٧٢، والبيهقي ٢/ ٢٠٩، انظر: صحيح الترمذي ١/ ١٤٤، وصحيح ابن ماجه ١/ ١٩٤، وإرواء الغليل ٢/ ١٧٢.
        """
    ),
    Dhikr(
        text: """
        اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ، لاَ أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ
        """,
        repetition: 1,
        note: """
        أخرجه أصحاب السنن الأربعة، وأحمد: أبو داود رقم ١٤٢٧، والترمذي رقم ٣٥٦٦، والنسائي رقم ١٧٤٦، وابن ماجه رقم ١١٧٩، وأحمد رقم ٧٥١.  
        انظر: صحيح الترمذي ٣/ ١٨٠، وصحيح ابن ماجه ١/ ١٩٤، والإرواء ٢/ ١٧٥.
        """
    ),
    Dhikr(
        text: """
        اللَّهُمَّ إِيَّاكَ نَعْبُدُ، وَلَكَ نُصَلِّي وَنَسْجُدُ، وَإِلَيْكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ، وَنَخْشَى عَذَابَكَ، إِنَّ عَذَابَكَ بِالْكَافِرِينَ مُلْحَقٌ. اللَّهُمَّ إِنَّا نَسْتَعِينُكَ، وَنَسْتَغْفِرُكَ، وَنُثْنِي عَلَيْكَ الْخَيْرَ، وَلاَ نَكْفُرُكَ، وَنُؤْمِنُ بِكَ، وَنَخْضَعُ لَكَ، وَنَخْلَعُ مَنْ يَكْفُرُكَ
        """,
        repetition: 1,
        note: """
        أخرجه البيهقي في السنن الكبرى، وصحَّح إسناده ٢/ ٢١١، وقال الألباني في إرواء الغليل: «إسناد صحيح» ٢/ ١٧٠. (موقوف على عمر)
        """
    )
]

let adkarsl20List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلاَءَ حُزْنِي، وَذَهَابَ هَمِّي»
        """,
        repetition: 1,
        note: """
        أحمد، ١/ ٣٩١، برقم ٣٧١٢، وصححه الألباني في سلسلة الأحاديث الصحيحة، ١/ ٣٣٧.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ»
        """,
        repetition: 1,
        note: """
        البخاري، ٧/ ١٥٨، برقم ٢٨٩٣، كان الرسول صَلَّى اللهُ عليهِ وسَلم يكثر من هذا الدعاء. انظر: البخاري مع الفتح، ١١/ ١٧٣، وسيأتي ص ٨٩، برقم ١٣٧.
        """
    )
]

let adkarsl21List: [Dhikr] = [
    Dhikr(
        text: """
        «لاَ إِلَهَ إِلاَّ اللَّهُ الْعَظِيمُ الْحَلِيمُ، لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ الْعَرْشِ الْعَظِيمِ، لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ السَّمَوَاتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيمِ»
        """,
        repetition: 1,
        note: """
        البخاري، ٧/ ١٥٤، برقم ٦٣٤٥، ومسلم، ٤/ ٢٠٩٢، برقم ٢٧٣٠.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ رَحْمَتَكَ أَرْجُو، فَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لاَ إِلَهَ إِلاَّ أَنْتَ»
        """,
        repetition: 1,
        note: """
        أبو داود، ٤/ ٣٢٤، برقم ٥٠٩٠، وأحمد، ٥/ ٤٢، برقم ٢٠٤٣٠، وحسّنه الألباني في صحيح أبي داود، ٣/ ٩٥٩.
        """
    ),
    Dhikr(
        text: """
        «لاَ إِلَهَ إِلاَّ أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظّالِمِينَ»
        """,
        repetition: 1,
        note: """
        الترمذي، ٥/ ٥٢٩، برقم ٣٥٠٥، والحاكم وصححه ووافقه الذهبي، ١/ ٥٠٥، وانظر: صحيح الترمذي، ٣/ ١٦٨.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُ اللَّهُ رَبِّي لاَ أُشْرِكُ بِهِ شَيْئًا»
        """,
        repetition: 1,
        note: """
        أخرجه أبو داود، ٢/ ٨٧، برقم ١٥٢٥، وابن ماجه، برقم ٣٨٨٢، وانظر: صحيح ابن ماجه، ٢/ ٣٣٥.
        """
    )
]

let adkarsl22List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِم، وَنَعُوذُ بِكَ مِنْ شُرُورِهِمْ»
        """,
        repetition: 1,
        note: """
        أبو داود، ٢/ ٨٩، برقم ١٥٣٧، وصححه الحاكم ووافقه الذهبي، ٢/ ١٤٢.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ أَنْتَ عَضُدِي، وَأَنْتَ نَصِيرِي، بِكَ أَحُولُ وَبِكَ أَصُولُ، وَبِكَ أُقاتِلُ»
        """,
        repetition: 1,
        note: """
        أبو داود، ٣/ ٤٢، برقم ٢٦٣٢، والترمذي، ٥/ ٥٧٢، برقم ٣٥٨٤، وانظر: صحيح الترمذي، ٣/ ١٨٣.
        """
    ),
    Dhikr(
        text: """
        «حَسْبُنا اللَّهُ وَنِعْمَ الْوَكِيلُ»
        """,
        repetition: 1,
        note: """
        البخاري، ٥/ ١٧٢، برقم ٤٥٦٣.
        """
    )
]

let adkarsl23List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ ربَّ السَّمَوَاتِ السَّبْعِ، وَرَبَّ الْعَرْشِ الْعَظِيمِ، كُنْ لِي جَارًا مِنْ فُلاَنِ بْنِ فُلاَنٍ، وَأَحْزَابِهِ مِنْ خَلاَئِقِكَ، أَنْ يَفْرُطَ عَلَيَّ أَحَدٌ مِنْهُمْ أَوْ يَطْغَى، عَزَّ جَارُكَ، وَجَلَّ ثَنَاؤُكَ، وَلاَ إِلَهَ إِلاَّ أَنْتَ»
        """,
        repetition: 1,
        note: """
        البخاري في الأدب المفرد، برقم ٧٠٧، وصححه الألباني في صحيح الأدب المفرد، برقم ٥٤٥.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُ أَكْبَرُ، اللَّهُ أَعَزُّ مِنْ خَلْقِهِ جَمِيعًا، اللَّهُ أَعَزُّ مِمَّا أَخَافُ وَأَحْذَرُ، أَعُوذُ بِاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ، الْمُمْسِكِ السَّمَوَاتِ السَّبْعِ أَنْ يَقَعْنَ عَلَى الْأَرْضِ إِلاَّ بِإِذْنِهِ، مِنْ شَرِّ عَبْدِكَ فُلاَنٍ، وَجُنُودِهِ وَأَتْبَاعِهِ وَأَشْيَاعِهِ، مِنْ الْجِنِّ وَالإِنْسِ، اللَّهُمَّ كُنْ لِي جَارًا مِنْ شَرِّهِمْ، جَلَّ ثَنَاؤُكَ وَعَزَّ جَارُكَ، وَتَبَارَكَ اسْمُكَ، وَلاَ إِلَهَ غَيْرُكَ»
        """,
        repetition: 1,
        note: """
        البخاري في الأدب المفرد، برقم ٧٠٨، وصححه الألباني في صحيح الأدب المفرد، برقم ٥٤٦.
        """
    )
]

let adkarsl24List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيعَ الْحِسَابِ، اهْزِمِ الأَحْزَابَ، اللَّهُمَّ اهزِمْهُمْ وَزَلْزِلْهُمْ»
        """,
        repetition: 1,
        note: """
        مسلم، ٣/ ١٣٦٢، برقم ١٧٤٢.
        """
    )
]

let adkarsl25List: [Dhikr] = [
    Dhikr(
        text: """
        «يَسْتَعِيذُ بِاللَّهِ»
        """,
        repetition: 1,
        note: """
        البخاري مع الفتح، ٦/ ٣٣٦، برقم ٣٢٧٦، ومسلم، ١/ ١٢٠، برقم ١٣٤.
        """
    ),
    Dhikr(
        text: """
        «يَنْتَهِي عَمَّا وَسْوَسَ فِيهِ»
        """,
        repetition: 1,
        note: """
        البخاري مع الفتح، ٦/ ٣٣٦، برقم ٣٢٧٦، ومسلم، ١/ ١٢٠، برقم ١٣٤.
        """
    ),
    Dhikr(
        text: """
        «آمَنْتُ بِاللَّهِ وَرُسُلِهِ»
        """,
        repetition: 1,
        note: """
        مسلم، ١/ ١١٩-١٢٠، برقم ١٣٤.
        """
    ),
    Dhikr(
        text: """
        «هُوَ الْأوَّلُ وَالْآخِرُ وَالظّاهِرُ وَالْباطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ»
        """,
        repetition: 1,
        note: """
        سورة الحديد، الآية: ٣. أبو داود، ٤/ ٣٢٩، برقم ٥١١٠، وحسنه الألباني في صحيح أبي داود، ٣/ ٩٦٢.
        """
    )
]

let adkarsl26List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكِ عَمَّنْ سِوَاكَ»
        """,
        repetition: 1,
        note: """
        الترمذي، ٥/ ٥٦٠، برقم ٣٥٦٣، وانظر: صحيح الترمذي، ٣/ ١٨٠.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ»
        """,
        repetition: 1,
        note: """
        البخاري، ٧/ ١٥٨، برقم ٢٨٩٣، ومسلم، ١/ ١٢٠، برقم ١٢١.
        """
    )
]

let adkarsl27List: [Dhikr] = [
    Dhikr(
        text: """
        «أَعُوذُ بِاللَّهِ مِنَ الشَّيطَانِ الرَّجِيمِ، وَاتْفُلْ عَلَى يَسَارِكَ ثلاثًا»
        """,
        repetition: 1,
        note: """
        مسلم، ٤/ ١٧٢٩، برقم ٢٢٠٣.
        """
    )
]

let adkarsl28List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ لاَ سَهْلَ إِلاَّ مَا جَعَلْتَهُ سَهْلًا، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذَا شِئْتَ سَهْلًا»
        """,
        repetition: 1,
        note: """
        رواه ابن حبان في صحيحه، برقم ٢٤٢٧، وابن السني، برقم ٣٥١، وصححه الأرناؤوط.
        """
    )
]

let adkarsl29List: [Dhikr] = [
    Dhikr(
        text: """
        «الْاسْتِعَاذَةُ بِاللَّهِ مِنْهُ»
        """,
        repetition: 1,
        note: """
        أبو داود، ١/ ٢٠٣، برقم ٨٠٧، وابن ماجه، ١/ ٢٦٥، برقم ٨٠٧.
        """
    ),
    Dhikr(
        text: """
        «الْأَذَانُ»
        """,
        repetition: 1,
        note: """
        مسلم، ١/ ٢٩١، برقم ٣٨٩، والبخاري، ١/ ١٥١، برقم ٦٠٨.
        """
    ),
    Dhikr(
        text: """
        «الْأَذْكَارُ وَقِرَاءَةُ الْقُرْآنِ»
        """,
        repetition: 1,
        note: """
        رواه مسلم، ١/ ٥٣٩، برقم ٧٨٠.
        """
    )
]

let adkarsl30List: [Dhikr] = [
    Dhikr(
        text: """
        «قَدَرُ اللَّهُ وَمَا شَاءَ فَعَلَ»
        """,
        repetition: 1,
        note: """
        «المؤمن القوي خير وأحبّ إلى اللَّه من المؤمن الضعيف، وفي كلٍّ خير، احرص على ما ينفعك، واستعن باللَّهِ ولا تعجز، وإن أصابك شيء فلا تقل: لو أني فعلت كان كذا وكذا، ولكن قل قدرُ اللَّه وما شاء فعل، فإنَّ لو تفتح عمل الشيطان». مسلم، ٤/ ٢٠٥٢، برقم ٢٦٦٤.
        """
    )
]

let adkarsl31List: [Dhikr] = [
    Dhikr(
        text: """
        «لاَ بأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ»
        """,
        repetition: 1,
        note: """
        البخاري مع الفتح، ١٠/ ١١٨، برقم ٣٦١٦.
        """
    ),
    Dhikr(
        text: """
        «أَسْأَلُ اللَّهَ الْعَظيمَ رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشْفيَكَ»
        """,
        repetition: 1,
        note: """
        «ما من عبد مسلم يعود مريضًا لم يحضر أجله فيقول سبع مرات...» الحديث. أخرجه الترمذي، برقم ٢٠٨٣، وأبو داود، برقم ٣١٠٦، وانظر: صحيح الترمذي، ٢/ ٢١٠، وصحيح الجامع، ٥/ ١٨٠.
        """
    )
]

let adkarsl32List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَأَلْحِقْنِي بِالرَّفِيقِ الْأَعْلَى»
        """,
        repetition: 1,
        note: """
        البخاري، ٧/ ١٠، برقم ٤٤٣٥، ومسلم، ٤/ ١٨٩٣، برقم ٢٤٤٤.
        """
    ),
    Dhikr(
        text: """
        «جَعَلَ النَّبِيُّ صَلَّى اللهُ عليهِ وسَلم عِنْدَ مَوْتِهِ يُدْخِلُ يَدَيْهِ فِي الْمَاءِ فَيَمْسَحُ بِهِمَا وَجْهَهُ، وَيَقُولُ: لاَ إِلَهَ إِلاَّ اللَّهُ إِنَّ لِلْمَوْتِ سَكَرَاتٍ»
        """,
        repetition: 1,
        note: """
        البخاري مع الفتح، ٨/ ١٤٤، برقم ٤٤٤٩، وفي الحديث ذكر السواك.
        """
    ),
    Dhikr(
        text: """
        «لاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ، لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ، لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لاَ إِلَهَ إِلاَّ اللَّهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، لاَ إِلَهَ إِلاَّ اللَّهُ وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ»
        """,
        repetition: 1,
        note: """
        أخرجه الترمذي، برقم ٣٤٣٠، وابن ماجه، برقم ٣٧٩٤، وصححه الألباني، انظر: صحيح الترمذي، ٣/ ١٥٢، وصحيح ابن ماجه، ٢/ ٣١٧.
        """
    )
]

let adkarsl33List: [Dhikr] = [
    Dhikr(
        text: """
        «إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي، وَأَخْلِفْ لِي خَيْرًا مِنْهَا»
        """,
        repetition: 1,
        note: """
        مسلم، ٢/ ٦٣٢، برقم ٩١٨.
        """
    )
]

let adkarsl34List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ اغْفِرْ لِفُلاَنٍ (بِاسْمِهِ) وَارْفَعْ دَرَجَتَهُ فِي الْمَهْدِيِّينَ، وَاخْلُفْهُ فِي عَقِبِهِ فِي الْغَابِرِينَ، وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ الْعَالَمِينَ، وَافْسَحْ لَهُ فِي قَبْرِهِ، وَنَوِّرْ لَهُ فِيهِ»
        """,
        repetition: 1,
        note: """
        مسلم، ٢/ ٦٣٤، برقم ٩٢٠.
        """
    )
]

let adkarsl35List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ، وَعَافِهِ، وَاعْفُ عَنْهُ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ، وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ، وَأَهْلًا خَيْرًا مِنْ أَهْلِهِ، وَزَوْجًا خَيْرًا مِنْ زَوْجِهِ، وَأَدْخِلْهُ الْجَنَّةَ، وَأَعِذْهُ مِنْ عَذَابِ القَبْرِ وَعَذَابِ النَّارِ»
        """,
        repetition: 1,
        note: """
        مسلم، ٢/ ٦٦٣، برقم ٩٦٣.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا، وَشَاهِدِنَا وَغَائِبِنَا، وَصَغِيرِنَا وَكَبيرِنَا، وَذَكَرِنَا وَأُنْثَانَا. اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الْإِسْلاَمِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيمَانِ، اللَّهُمَّ لاَ تَحْرِمْنَا أَجْرَهُ، وَلاَ تُضِلَّنَا بَعْدَهُ»
        """,
        repetition: 1,
        note: """
        أبو داود، برقم ٣٢٠١، والترمذي، برقم ١٠٢٤، والنسائي، برقم ١٩٨٥، وابن ماجه، ١/ ٤٨٠، برقم ١٤٩٨، وأحمد، ٢/ ٣٦٨، برقم ٨٨٠٩، وانظر: صحيح ابن ماجه، ١/ ٢٥١.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ إِنَّ فُلاَنَ بْنَ فُلاَنٍ فِي ذِمَّتِكَ، وَحَبْلِ جِوَارِكَ، فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ، وَعَذَابِ النَّارِ، وَأَنْتَ أَهْلُ الْوَفَاءِ وَالْحَقِّ، فَاغْفِرْ لَهُ وَارْحَمْهُ إِنَّكَ أَنْتَ الغَفُورُ الرَّحيمُ»
        """,
        repetition: 1,
        note: """
        أخرجه ابن ماجه، برقم ١٤٩٩، انظر: صحيح ابن ماجه، ١/ ٢٥١، ورواه أبو داود، ٣/ ٢١١، برقم ٣٢٠٢.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ عَبْدُكَ وَابْنُ أَمَتِكَ احْتَاجَ إِلَى رَحْمَتِكَ، وَأَنْتَ غَنِيٌّ عَنْ عَذَابِهِ، إِنْ كَانَ مُحْسِنًا فَزِدْ فِي حَسَنَاتِهِ، وَإِنْ كَانَ مُسِيئًا فَتَجَاوَزْ عَنْهُ»
        """,
        repetition: 1,
        note: """
        أخرجه الحاكم وصححه ووافقه الذهبي، ١/ ٣٥٩، وانظر: أحكام الجنائز للألباني، ص١٢٥.
        """
    )
]

let adkarsl36List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ أَعِذْهُ مِنْ عَذَابِ القَبْرِ. و إن قال: "اللَّهُمَّ اجْعَلْهُ فَرَطًا وَذُخْرًا لِوَالِدَيْهِ، وَشَفِيعًا مُجَابًا، اللَّهُمَّ ثَقِّلْ بِهِ مَوَازِينَهُمَا، وَأَعْظِمْ بِهِ أُجورَهُمَا، وَأَلْحِقْهُ بِصَالِحِ الْمُؤْمِنِينَ، وَاجْعَلْهُ فِي كَفَالَةِ إِبْرَاهِيمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الْجَحِيمِ، وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ، وَأَهْلًا خَيْرًا مِنْ أَهْلِهِ، اللَّهُمَّ اغْفِرْ لِأَسْلاَفِنَا، وَأَفْرَاطِنَا، وَمَنْ سَبَقَنَا بِالْإِيمَانِ" فَحَسَنٌ»
        """,
        repetition: 1,
        note: """
        «قال سعيد بن المسيب: صلّيتُ وراء أبي هريرة على صبيٍّ لم يعمل خطيئة قَطُّ، فسمعته يقول...» أخرجه مالك في الموطأ، ١/ ٢٨٨، وابن أبي شيبة في المصنف، ٣/ ٢١٧، والبيهقي، ٤/ ٩، وصحح إسناده شعيب الأرناؤوط في تحقيقه لشرح السنة للبغوي، ٥/ ٣٥٧.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ اجْعَلْهُ لَنَا فَرَطًا، وَسَلَفًا، وَأَجْرًا»
        """,
        repetition: 1,
        note: """
        كان الحسن يقرأ على الطفل بفاتحة الكتاب، ويقول...» أخرجه البغوي في شرح السنة، ٥/ ٣٥٧، وعبدالرزاق، برقم ٦٥٨٨، وعلقه البخاري في كتاب الجنائز، ٢/ ١١٣.
        """
    )
]

let adkarsl37List: [Dhikr] = [
    Dhikr(
        text: """
        «إِنَّ لِلَّهِ مَا أَخَذَ، وَلَهُ مَا أَعْطَى، وَكُلُّ شَيْءٍ عِنْدَهُ بِأَجَلٍ مُسَمَّى... فَلْتَصْبِرْ وَلْتَحْتَسِبْ» و إن قال: «أَعْظَمَ اللَّهُ أَجْرَكَ، وَأَحْسَنَ عَزَاءَكَ، وَغَفَرَ لِمَيِّتِكَ» فَحَسَنٌ
        """,
        repetition: 1,
        note: """
        البخاري، ٢/ ٨٠، برقم ١٢٨٤، ومسلم، ٢/ ٦٣٦، برقم ٩٢٣.
        """
    )
]

let adkarsl38List: [Dhikr] = [
    Dhikr(
        text: """
        «بِسْمِ اللَّهِ وَعَلَى سُنَّةِ رَسُولِ اللَّهِ»
        """,
        repetition: 1,
        note: """
        أبو داود، ٣/ ٣١٤، برقم ٣٢١٥، بسند صحيح، وأحمد، برقم ٥٢٣٤، ورقم ٤٨١٢ بلفظ: «بسم اللَّه، وعلى ملّة رسول اللَّه»، وسنده صحيح.
        """
    )
]

let adkarsl39List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ثَبِّتْهُ»
        """,
        repetition: 1,
        note: """
        كان النبي صَلَّى اللهُ عليهِ وسَلم إذا فرغ من دفن الميت وقف عليه وقال: «استغفروا لأخيكم، وسلوا له التثبيت؛ فإنه الآن يُسأل». أبو داود، ٣/ ٣١٥، برقم ٣٢٢٣، والحاكم وصححه، ووافقه الذهبي ١/ ٣٧٠.
        """
    )
]

let adkarsl40List: [Dhikr] = [
    Dhikr(
        text: """
        «السَّلاَمُ عَلَيْكُمْ أَهْلَ الدِّيَارِ، مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ، وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ، [وَيَرْحَمُ اللَّهُ الْمُسْتَقدِمِينَ مِنَّا وَالْمُسْتأْخِرِينَ] أَسْاَلُ اللَّهَ لَنَا وَلَكُمُ الْعَافِيَةَ»
        """,
        repetition: 1,
        note: """
        مسلم، ٢/ ٦٧١، برقم ٩٧٥، وابن ماجه، ١/ ٤٩٤، واللفظ له، برقم ١٥٤٧ عن بريدة رضي الله عنه، وما بين المعقوفين من حديث عائشة رَضِيَ اللهُ عَنْهَا عند مسلم، ٢/ ٦٧١، برقم ٩٧٥.
        """
    )
]

let adkarsl41List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا»
        """,
        repetition: 1,
        note: """
        أخرجه أبو داود، ٤/ ٣٢٦، برقم ٥٠٩٩، وابن ماجه، ٢/ ١٢٢٨، برقم ٣٧٢٧، وانظر: صحيح ابن ماجه، ٢/ ٣٠٥.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا فِيهَا، وَخَيْرَ مَا أُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا فِيهَا، وَشَرِّ مَا أُرْسِلَتْ بِهِ»
        """,
        repetition: 1,
        note: """
        مسلم، واللفظ له، ٢/ ٦٦٦، برقم ٨٩٩، والبخاري، ٤/ ٧٦ برقم ٣٢٠٦، ورقم ٤٨٢٩.
        """
    )
]

let adkarsl42List: [Dhikr] = [
    Dhikr(
        text: """
        «سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلاَئِكةُ مِنْ خِيفَتِهِ»
        """,
        repetition: 1,
        note: """
        كان عبد الله بن الزبير رضي الله عنه إذا سمع الرعد ترك الحديث وقال:... الحديث، الموطأ، ٢/ ٩٩٢، وقال الألباني في صحيح الكلم الطيب، ١٥٧: «صحيح الإسناد موقوفًا».
        """
    )
]

let adkarsl43List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ اسْقِنَا غَيْثًا مُغِيثًا مَرِيئًا مَرِيعًا، نَافِعًا غَيْرَ ضَارٍّ، عَاجِلًا غَيْرَ آجِلٍ»
        """,
        repetition: 1,
        note: """
        أبو داود، ١/ ٣٠٣، برقم ١١٧١، وصححه الألباني في صحيح أبي داود، ١/ ٢١٦.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا»
        """,
        repetition: 1,
        note: """
        البخاري، ١/ ٢٢٤، برقم ١٠١٤، ومسلم، ٢/ ٦١٣، برقم ٨٩٧.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ اسْقِ عِبَادَكَ، وَبَهَائِمَكَ، وَانْشُرْ رَحْمَتَكَ، وَأَحْيِي بَلَدَكَ الْمَيِّتَ»
        """,
        repetition: 1,
        note: """
        أبو داود، ١/ ٣٠٥، برقم ١١٧٨، وحسنه الألباني في صحيح أبي داود، ١/ ٢١٨.
        """
    )
]

let adkarsl44List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ صَيِّبًا نَافِعًا»
        """,
        repetition: 1,
        note: """
        البخاري مع الفتح، ٢/ ٥١٨، برقم ١٠٣٢.
        """
    )
]

let adkarsl45List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا، اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ، وَبُطُونِ الْأَوْدِيَةِ، وَمَنَابِتِ الشَّجَرِ»
        """,
        repetition: 1,
        note: """
        البخاري، ١/ ٢٢٤، برقم ٩٣٣، ومسلم، ٢/ ٦١٤، برقم ٨٩٧.
        """
    )
]

let adkarsl46List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُ أَكْبَرُ، اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالْأَمْنِ وَالْإِيمَانِ، وَالسَّلاَمَةِ وَالْإِسْلاَمِ، وَالتَّوْفِيقِ لِمَا تُحِبُّ رَبَّنَا وَتَرْضَى، رَبُّنَا وَرَبُّكَ اللَّهُ»
        """,
        repetition: 1,
        note: """
        الترمذي، ٥/ ٥٠٤، برقم ٣٤٥١، والدارمي بلفظه، ١/ ٣٣٦، وانظر: صحيح الترمذي، ٣/ ١٥٧.
        """
    )
]

let adkarsl47List: [Dhikr] = [
    Dhikr(
        text: """
        «ذَهَبَ الظَّمَأُ وَابْتَلَّتِ العُرُوقُ، وَثَبَتَ الْأَجْرُ إِنْ شَاءَ اللَّهُ»
        """,
        repetition: 1,
        note: """
        أخرجه أبو داود، ٢/ ٣٠٦، برقم ٢٣٥٩، وغيره. وانظر: صحيح الجامع، ٤/ ٢٠٩.
        """
    ),
    Dhikr(
        text: """
        «اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ أَنْ تَغْفِرَ لِي»
        """,
        repetition: 1,
        note: """
        أخرجه ابن ماجه، ١/ ٥٥٧، برقم ١٧٥٣ من دعاء عبد الله بن عمرو رضي الله عنه، وحسنه الحافظ في تخريج الأذكار. انظر: شرح الأذكار، ٤/ ٣٤٢.
        """
    )
]

let adkarsl48List: [Dhikr] = [
    Dhikr(
        text: """
        «إِذَا أَكَلَ أَحَدُكُمْ طَعَامًا فَلْيَقُلْ بِسْمِ اللَّهِ، فَإِنْ نَسِيَ فِي أَوَّلِهِ فَلْيَقُلْ بسمِ اللَّهِ فِي أَوَّلِهِ وَآخِرِهِ»
        """,
        repetition: 1,
        note: """
        أخرجه أبو داود، ٣/ ٣٤٧، برقم ٣٧٦٧، والترمذي، ٤/ ٢٨٨، برقم ١٨٥٨، وانظر: صحيح الترمذي، ٢/ ١٦٧.
        """
    ),
    Dhikr(
        text: """
        «مَنْ أَطْعَمَهُ اللَّهُ الطَّعَامَ فَلْيَقُلْ: اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَأَطْعِمْنَا خَيْرًا مِنْهُ، وَمَنْ سَقَاهُ اللَّهُ لَبَنًا فَلْيَقُلْ اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَزِدْنَا مِنْهُ»
        """,
        repetition: 1,
        note: """
        الترمذي، ٥/ ٥٠٦، برقم ٣٤٥٥، وانظر: صحيح الترمذي، ٣/ ١٥٨.
        """
    )
]

let adkarsl49List: [Dhikr] = [
    Dhikr(
        text: """
        «الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا، وَرَزَقَنِيهِ، مِنْ غَيْرِ حَوْلٍ مِنِّي وَلاَ قُوَّةٍ»
        """,
        repetition: 1,
        note: """
        أخرجه أصحاب السنن إلا النسائي: أبو داود، برقم ٤٠٢٥، والترمذي، برقم ٣٤٥٨، وابن ماجه، برقم ٣٢٨٥، وانظر صحيح الترمذي، ٣/ ١٥٩.
        """
    ),
    Dhikr(
        text: """
        «الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ، غَيْرَ [مَكْفِيٍّ وَلاَ ] مُوَدَّعٍ، وَلاَ مُسْتَغْنَىً عَنْهُ رَبَّنَا»
        """,
        repetition: 1,
        note: """
        البخاري، ٦/ ٢١٤، برقم ٥٤٥٨، والترمذي بلفظه، ٥/ ٥٠٧، برقم ٣٤٥٦.
        """
    )
]

let adkarsl50List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ بَارِكْ لَهُمْ فِيمَا رَزَقْتَهُم، وَاغْفِرْ لَهُمْ وَارْحَمْهُمْ»
        """,
        repetition: 1,
        note: """
        مسلم، ٣/ ١٦١٥، برقم ٢٠٤٢.
        """
    )
]

let adkarsl51List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ أَطْعِمْ مَنْ أَطْعَمَنِي، وَاسْقِ مَنْ سَقَانِي»
        """,
        repetition: 1,
        note: """
        مسلم، ٣/ ١٦٢٦، برقم ٢٠٥٥.
        """
    )
]

let adkarsl52List: [Dhikr] = [
    Dhikr(
        text: """
        «أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ، وَأَكَلَ طَعَامَكُمُ الْأَبْرَارُ، وَصَلَّتْ عَلَيْكُمُ الْمَلاَئِكَةُ»
        """,
        repetition: 1,
        note: """
        سنن أبي داود، ٣/ ٣٦٧، برقم ٣٨٥٦، وابن ماجه، ١/ ٥٥٦، برقم ١٧٤٧، والنسائي في عمل اليوم والليلة، برقم ٢٩٦-٢٩٨، ونصّ على أنه صَلَّى اللهُ عليهِ وسَلم يقوله إذا أفطر عند أهل بيت، وصححه الألباني في صحيح أبي داود، ٢/ ٧٣٠.
        """
    )
]

let adkarsl53List: [Dhikr] = [
    Dhikr(
        text: """
        «إِذَا دُعِيَ أَحَدُكُمْ فَلْيُجِبْ، فَإِنْ كَانَ صَائِمًا فَلْيُصَلِّ، وَإِنْ كَانَ مُفْطِرًا فَلْيَطْعَمْ»
        """,
        repetition: 1,
        note: """
        مسلم، ٢/ ١٠٥٤، برقم ١١٥٠.
        """
    )
]

let adkarsl54List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا، وَبَارِكْ لَنَا فِي مَدِينَتِنَا، وَبَارِكْ لَنَا فِي صَاعِنَا، وَبَارِكْ لَنَا فِي مُدِّنَا»
        """,
        repetition: 1,
        note: """
        مسلم، ٢/ ١٠٠٠، برقم ١٣٧٣.
        """
    )
]

let adkarsl55List: [Dhikr] = [
    Dhikr(
        text: """
        «إِذَا عَطَسَ أَحَدُكُم فَلْيَقُلِ الْحَمْدُ لِلَّهِ، وَلْيَقُلْ لَهُ أَخُوهُ أَوْصَاحِبُهُ: يَرْحَمُكَ اللَّهُ، فَإِذَا قَالَ لَهُ: يَرْحَمُكَ اللَّهُ، فَلْيَقُلْ: يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ»
        """,
        repetition: 1,
        note: """
        البخاري، ٧/ ١٢٥، برقم ٥٨٧٠.
        """
    )
]

let adkarsl56List: [Dhikr] = [
    Dhikr(
        text: """
        «بَارَكَ اللَّهُ لَكَ، وَبَارَكَ عَلَيْكَ، وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ»
        """,
        repetition: 1,
        note: """
        أخرجه أصحاب السنن إلا النسائي: أبو داود، برقم ٢١٣٠، والترمذي، برقم ١٠٩١، وابن ماجه، برقم ١٩٠٥، والنسائي في عمل اليوم والليلة، برقم ٢٥٩، وانظر: صحيح الترمذي، ١/ ٣١٦.
        """
    )
]

let adkarsl57List: [Dhikr] = [
    Dhikr(
        text: """
        «إِذَا تَزَوَّجَ أَحَدُكُمُ امْرَأَةً، أَوْ إِذَا اشْتَرَى خَادِمًا فَلْيَقُلْ: اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ، وَإِذَا اشْتَرَى بَعِيرًا فَلْيَأْخُذْ بِذِرْوَةِ سَنَامِهِ وَلْيَقُلْ مِثْلَ ذَلِكَ»
        """,
        repetition: 1,
        note: """
        أبو داود، ٢/ ٢٤٨، برقم ٢١٦٠، وابن ماجه، ١/ ٦١٧، برقم ١٩١٨، وانظر: صحيح ابن ماجه، ١/ ٣٢٤.
        """
    )
]

let adkarsl58List: [Dhikr] = [
    Dhikr(
        text: """
        «بِسْمِ اللَّهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا»
        """,
        repetition: 1,
        note: """
        البخاري، ٦/ ١٤١، برقم ١٤١، ومسلم، ٢/ ١٠٢٨، برقم ١٤٣٤.
        """
    )
]

let adkarsl59List: [Dhikr] = [
    Dhikr(
        text: """
        «أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ»
        """,
        repetition: 1,
        note: """
        البخاري، ٧/ ٩٩، برقم ٣٢٨٢، ومسلم، ٤/ ٢٠١٥، برقم ٢٦١٠.
        """
    )
]

let adkarsl60List: [Dhikr] = [
    Dhikr(
        text: """
        «الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي مِمَّا ابْتَلاَكَ بِهِ، وَفَضَّلَنِي عَلَى كَثِيرٍ مِمَّنْ خَلَقَ تَفْضِيلًا»
        """,
        repetition: 1,
        note: """
        الترمذي، ٥/ ٤٩٤، و٥/ ٤٩٣، برقم ٣٤٣٢، وانظر: صحيح الترمذي، ٣/ ١٥٣.
        """
    )
]

let adkarsl61List: [Dhikr] = [
    Dhikr(
        text: """
        ولكَ
        """,
        repetition: 1,
        note: """
        أحمد، ٥/ ٨٢، برقم ٢٠٧٧٨، والنسائي في عمل اليوم والليلة، ص٢١٨، برقم ٤٢١، تحقيق الدكتور فاروق حمادة.
        """
    )
]

let adkarsl62List: [Dhikr] = [
    Dhikr(
        text: """
        «جَزَاكَ اللَّهُ خَيْرًا»
        """,
        repetition: 1,
        note: """
        أخرجه الترمذي، برقم ٢٠٣٥، وانظر: صحيح الجامع، ٦٢٤٤ وصحيح الترمذي، ٢/ ٢٠٠.
        """
    )
]

let adkarsl63List: [Dhikr] = [
    Dhikr(
        text: """
        «أَحَبَّكَ الَّذِي أَحْبَبْتَنِي لَهُ»
        """,
        repetition: 1,
        note: """
        أخرجه أبو داود، ٤/ ٣٣٣، برقم ٥١٢٥، وحسّنه الألباني في صحيح سنن أبي داود، ٣/ ٩٦٥.
        """
    )
]

let adkarsl64List: [Dhikr] = [
    Dhikr(
        text: """
        «بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ»
        """,
        repetition: 1,
        note: """
        البخاري مع الفتح، ٤/ ٢٨٨، برقم ٢٠٤٩.
        """
    )
]

let adkarsl65List: [Dhikr] = [
    Dhikr(
        text: """
        «بارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ، إِنَّمَا جَزَاءُ السَّلَفِ الْحَمْدُ وَالأَدَاءُ»
        """,
        repetition: 1,
        note: """
        أخرجه النسائي في عمل اليوم والليلة، ص٣٠٠، وابن ماجه، ٢/ ٨٠٩، برقم ٢٤٢٤، وانظر: صحيح ابن ماجه، ٢/ ٥٥.
        """
    )
]

let adkarsl66List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا لاَ أَعْلَمُ»
        """,
        repetition: 1,
        note: """
        أحمد، ٤/ ٤٠٣، برقم ١٩٦٠٦، والأدب المفرد للبخاري، برقم ٧١٦، وانظر: صحيح الجامع، ٣/ ٢٣٣، وصحيح الترغيب والترهيب للألباني، ١/ ١٩.
        """
    )
]

let adkarsl67List: [Dhikr] = [
    Dhikr(
        text: """
        «وَفِيكَ بَارَكَ اللَّهُ»
        """,
        repetition: 1,
        note: """
        أخرجه ابن السني، ص١٣٨، برقم ٢٧٨، وانظر: الوابل الصيب لابن القيم، ص٣٠٤، تحقيق بشير محمد عيون.
        """
    )
]

let adkarsl68List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ لاَ طَيْرَ إِلاَّ طَيْرُكَ، وَلاَ خَيْرَ إِلاَّ خَيْرُكَ، وَلاَ إِلَهَ غَيْرُكَ»
        """,
        repetition: 1,
        note: """
        أحمد، ٢/ ٢٢٠، برقم ٧٠٤٥، وابن السني، برقم ٢٩٢، وصححه الألباني في سلسلة الأحاديث الصحيحة، ٣/ ٥٤، برقم ١٠٦٥، أما الفأل فكان يعجب النبي صَلَّى اللهُ عليهِ وسَلم؛ ولهذا سمع من رجل كلمة طيبة فأعجبته فقال: «أخذنا فألك من فيك»، أبو داود، برقم ٣٧١٩، وأحمد، برقم ٩٠٤٠، وصححه الألباني في سلسلة الأحاديث الصحيحة، ٢/ ٣٦٣، عند أبي الشيخ في أخلاق النبي صَلَّى اللهُ عليهِ وسَلم، ص٢٧٠.
        """
    )
]

let adkarsl69List: [Dhikr] = [
    Dhikr(
        text: """
        «بِسْمِ اللَّهِ، وَالْحَمْدُ للَّهِ» {سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ}، «الْحَمْدُ لِلَّهِ، الْحَمْدُ لِلَّهِ، الْحَمْدُ لِلَّهِ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، سُبْحَانَكَ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي؛ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ»
        """,
        repetition: 1,
        note: """
        أبو داود، ٣/ ٣٤، برقم ٢٦٠٢، والترمذي، ٥/ ٥٠١، برقم ٣٤٤٦، وانظر: صحيح الترمذي، ٣/ ١٥٦، الآيتان من سورة الزخرف:١٣-١٤.
        """
    )
]

let adkarsl70List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ، اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا البِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيفَةُ فِي الْأَهْلِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآبَةِ الْمَنْظَرِ، وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ»
        وإذا رَجَعَ قَالَهُنَّ وَزَادَ فِيهِنَّ: «آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ»
        """,
        repetition: 1,
        note: """
        مسلم، ٢/٩٧٨، برقم ١٣٤٢.
        """
    )
]

let adkarsl711List: [Dhikr] = [
    Dhikr(
        text: """
        «يُكَبِّرُ عَلَى كُلِّ شَرَفٍ ثَلاَثَ تَكْبِيرَاتٍ ثُمَّ يَقُولُ: لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنا حَامِدُونَ، صَدَقَ اللَّهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزابَ وَحْدَهُ»
        """,
        repetition: 1,
        note: "كان النبي صَلَّى اللهُ عليهِ وسَلم يقوله إذا قَفَلَ من غزوٍ أو حجٍّ، البخاري، ٧/١٦٣، برقم ١٧٩٧، ومسلم، ٢/٩٨٠، برقم ١٣٤٤."
    )
]


let adkarsl71List: [Dhikr] = [
    Dhikr(
        text: """
        «اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ الأَرَضِينَ السَّبْعِ وَمَا أَقْلَلْنَ، وَرَبَّ الشَّياطِينِ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ، أَسْأَلُكَ خَيْرَ هَذِهِ الْقَرْيَةِ، وَخَيْرَ أَهْلِهَا، وَخَيْرَ مَا فِيهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ أَهْلِهَا، وَشَرِّ مَا فِيهَا»
        """,
        repetition: 1,
        note: """
        الحاكم وصححه ووافقه الذهبي، ٢/ ١٠٠، وابن السني، برقم ٥٢٤، وحسّنه الحافظ في تخريج الأذكار، ٥/ ١٥٤، قال العلامة ابن باز: «ورواه النسائي بإسناد حسن». انظر: تحفة الأخيار، ص٣٧.
        """
    )
]

let adkarsl72List: [Dhikr] = [
    Dhikr(
        text: """
        «لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، يُحْيِي وَيُمِيتُ، وَهُوَ حَيٌّ لاَ يَمُوتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ»
        """,
        repetition: 1,
        note: """
        الترمذي، برقم ٣٤٢٨، وابن ماجه، ٥/ ٢٩١، برقم ٣٨٦٠، والحاكم، ١/ ٥٣٨، وحسنه الألباني في صحيح ابن ماجه، ٢/ ٢١، وفي صحيح الترمذي، ٣/ ١٥٢.
        """
    )
]

let adkarsl73List: [Dhikr] = [
    Dhikr(
        text: """
        «بِسْمِ اللَّهِ»
        """,
        repetition: 1,
        note: """
        أبو داود، ٤/ ٢٩٦، برقم ٤٩٨٢، وصححه الألباني في صحيح أبي داود، ٣/ ٩٤١.
        """
    )
]

let adkarsl74List: [Dhikr] = [
    Dhikr(
        text: """
        «أَسْتَوْدِعُكُمُ اللَّهَ الَّذِي لاَ تَضِيعُ وَدَائِعُهُ»
        """,
        repetition: 1,
        note: """
        أحمد، ٢/ ٤٠٣، برقم ٩٢٣٠، وابن ماجه، ٢/ ٩٤٣، برقم ٢٨٢٥، وانظر: صحيح ابن ماجه، ٢/ ١٣٣.
        """
    )
]

let adkarsl75List: [Dhikr] = [
    Dhikr(
        text: """
        «أَسْتَوْدِعُ اللَّهَ دِينَكَ، وَأَمَانَتَكَ، وَخَوَاتِيمَ عَمَلِكَ»
        """,
        repetition: 1,
        note: """
        أحمد، ٢/ ٧، برقم ٤٥٢٤، والترمذي، ٥/ ٤٩٩، برقم ٣٤٤٣، وصححه الألباني في صحيح سنن الترمذي، ٣/ ٤١٩.
        """
    ),
    Dhikr(
        text: """
        «زَوَّدَكَ اللَّهُ التَّقْوَى، وَغَفَرَ ذَنْبَكَ، وَيَسَّرَ لَكَ الخَيْرَ حَيْثُ ما كُنْتَ»
        """,
        repetition: 1,
        note: """
        الترمذي، برقم ٣٤٤٤، وانظر: صحيح الترمذي، ٣/ ١٥٥.
        """
    )
]

let adkarsl76List: [Dhikr] = [
    Dhikr(
        text: """
        «سَمَّعَ سَامِعٌ بِحَمْدِ اللَّهِ، وَحُسْنِ بَلاَئِهِ عَلَيْنَا، رَبَّنَا صاحِبْنَا، وَأَفْضِلْ عَلَيْنَا، عَائِذًا بِاللَّهِ مِنَ النَّارِ»
        """,
        repetition: 1,
        note: """
        مسلم، ٤/ ٢٠٨٦، برقم ٢٧١٨، ومعنى «سَمَّعَ سَامِعٌ»: أي شهد شاهدٌ على حمدنا لله تعالى على نعمه، وحسن بلائه. شرح النووي على صحيح مسلم، ١٧/ ٣٩.
        """
    )
]

let adkarsl77List: [Dhikr] = [
    Dhikr(
        text: """
        «أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ»
        """,
        repetition: 1,
        note: """
        مسلم، ٤/ ٢٠٨٠، برقم ٢٧٠٩.
        """
    )
]

let adkarsl78List: [Dhikr] = [
    Dhikr(
        text: """
        «إِذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ فَاسْأَلُوا اللَّهَ مِنْ فَضْلِهِ؛ فَإِنَّهَا رَأَتْ مَلَكًا، وَإِذَا سَمِعْتُمْ نَهِيقَ الْحِمَارِ فَتَعَوَّذُوا بِاللَّهِ مِنَ الشَّيطَانِ؛ فَإِنَّهُ رَأَى شَيْطَانًا»
        """,
        repetition: 1,
        note: """
        البخاري مع الفتح، ٦/ ٣٥٠، برقم ٣٣٠٣، ومسلم، ٤/ ٢٠٩٢، برقم ٢٧٢٩.
        """
    )
]

let adkarsl79List: [Dhikr] = [
    Dhikr(
        text: """
        «إِذَا سَمِعْتُمْ نُبَاحَ الْكِلاَبِ وَنَهِيقَ الْحَمِيرِ بِاللَّيْلِ فَتَعَوَّذُوا بِاللَّهِ مِنْهُنَّ؛ فَإِنَّهُنَّ يَرَيْنَ مَا لاَ تَرَوْنَ»
        """,
        repetition: 1,
        note: """
        أبو داود، ٤/ ٣٢٧، برقم ٥١٠٥، وأحمد، ٣/ ٣٠٦، برقم ١٤٢٨٣، وصححه الألباني في صحيح أبي داود، ٣/ ٩٦١.
        """
    )
]

let adkarsl80List: [Dhikr] = [
    Dhikr(
        text: """
        «قَالَ النَّبِيُّ صَلَّى اللهُ عليهِ وسَلم: 'اللَّهُمَّ فَأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إِلَيْكَ يَوْمَ الْقِيَامَةِ'»
        """,
        repetition: 1,
        note: """
        البخاري مع الفتح، ١١/ ١٧١، برقم ٦٣٦١، ومسلم، ٤/ ٢٠٠٧، برقم ٣٩٦ (لفظه: «فاجعلها له زكاةً ورحمةً»).
        """
    )
]

let adkarsl81List: [Dhikr] = [
    Dhikr(
        text: """
        {رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ}
        """,
        repetition: 1,
        note: """
        أبو داود، ٢/ ١٧٩، برقم ١٨٩٤، وأحمد، ٣/ ٤١١، برقم ١٥٣٩٨، والبغوي في شرح السنة، ٧/ ١٢٨، وحسنه الألباني في صحيح أبي داود، ١/ ٣٥٤، والآية من سورة البقرة: ٢٠١.
        """
    )
]

let adkarsl82List: [Dhikr] = [
    Dhikr(
        text: """
        «لَمَّا دَنَا النَّبِيُّ صَلَّى اللهُ عليهِ وسَلم مِنَ الصَّفَا قَرَأَ: {إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَآئِرِ اللَّهِ} أَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ» فَبَدَأَ بِالصَّفَا فَرَقِيَ عَلَيْهِ حَتَّى رَأَى الْبَيْتَ، فَاسْتَقْبَلَ الْقِبْلَةَ، فَوَحَّدَ اللَّهَ وَكبَّرَهُ وَقَالَ: «لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ، ثُمَّ دَعَا بَيْنَ ذلكَ. قَالَ مِثْلَ هَذَا ثَلاَثَ مَرَّاتٍ» الْحَدِيثُ. وَفِيهِ: «فَفَعَلَ عَلَى الْمَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا»
        """,
        repetition: 1,
        note: """
        مسلم، ٢/ ٨٨٨، برقم ١٢١٨، والآية من سورة البقرة، رقم ١٥٨.
        """
    )
]

let adkarsl83List: [Dhikr] = [
    Dhikr(
        text: """
        قَالَ النَّبِيُّ صَلَّى اللهُ عليهِ وسَلم: «خَيْرُ الدُّعَاءِ دُعَاءُ يَوْمِ عَرَفَةَ، وَخَيْرُ مَا قُلْتُ أَنَا وَالنَّبيُّونَ مِنْ قَبْلِي: لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ»
        """,
        repetition: 1,
        note: """
        الترمذي، برقم ٣٥٨٥، وحسنه الألباني في صحيح الترمذي، ٣/ ١٨٤، وفي سلسلة الأحاديث الصحيحة، ٤/ ٦.
        """
    )
]

let adkarsl84List: [Dhikr] = [
    Dhikr(
        text: """
        «إِذَا رَأَى أَحَدُكُم مِنْ أَخِيهِ، أَوْ مِنْ نَفْسِهِ، أَوْ مِنْ مَالِهِ مَا يُعْجِبُهُ [فَلْيَدْعُ لَهُ بِالْبَرَكَةِ] فَإِنَّ الْعَيْنَ حَقٌّ»
        """,
        repetition: 1,
        note: """
        مسند أحمد ٤/ ٤٤٧، برقم ١٥٧٠٠، وابن ماجه، برقم ٣٥٠٨، ومالك، ٣/ ١١٨-١١٩، وصححه الألباني في صحيح الجامع ١/ ٢١٢، وانظر تحقيق زاد المعاد للأرناؤوط ٤/ ١٧٠.
        """
    )
]



