


import Foundation

/// مصفوفة الأذكار الخاصة بالحالة adkarsl2
let adkarsl1List: [Dhikr] = [

        Dhikr(text: """
            ﴿أَعوذُ بِاللّهِ أَن أَكونَ مِنَ الجاهِلينَ﴾
            """,
              repetition: 1,
              note: "سورة البقرة: آية ٦٧"),
        
        Dhikr(text: """
            ﴿ربَّنا تَقَبَّل مِنّا إِنَّكَ أَنتَ السَّميعُ العَليمُ﴾
            """,
              repetition: 1,
              note: "سورة البقرة: آية ١٢٧"),
        
        Dhikr(text: """
            ﴿وتُب عَلَينا إِنَّكَ أَنتَ التَّوّابُ الرَّحيمُ﴾
            """,
              repetition: 1,
              note: "سورة البقرة: آية ١٢٨"),
        
        Dhikr(text: """
            ﴿ربَّنا لا تُؤاخِذنا إِن نَسينا أو أَخطَأنا ربَّنا ولا تَحمِل علينا إصرًا كما حَمَلتَهُ على الَّذينَ مِن قَبلِنا ربَّنا ولا تُحمِّلنا ما لا طاقة لنا بِهِ واعفُ عنّا واغفِر لنا وارحَمنا أَنتَ مَولانا فَانصُرنا على القَومِ الكافِرينَ﴾
            """,
              repetition: 1,
              note: "سورة البقرة: آية ٢٨٦"),
        
        Dhikr(text: """
            ﴿ربَّنا لا تُزِغ قُلوبَنا بَعدَ إِذ هَدَيتَنا وهَبْ لنا مِن لَدُنكَ رَحمَةً إِنَّكَ أَنتَ الوهّابُ﴾
            """,
              repetition: 1,
              note: "سورة آل عمران: آية ٨"),
        
        Dhikr(text: """
            ﴿ربَّنا إِنَّنا آمَنّا فَاغفِر لَنا ذُنوبَنا وقِنا عَذابَ النّارِ﴾
            """,
              repetition: 1,
              note: "سورة آل عمران: آية ١٦"),
        
        Dhikr(text: """
            ﴿ربَّنا اغفِر لنا ذُنوبَنا وإِسرافَنا في أَمرِنا وثَبِّت أَقدامَنا وانصُرنا على القَومِ الكافِرينَ﴾
            """,
              repetition: 1,
              note: "سورة آل عمران: آية ١٤٧"),
        
        Dhikr(text: """
            ﴿ربَّنا إنَّنا سَمِعنا مُنادِيًا يُنادي للإيمانِ أن آمِنوا بِرَبِّكُم فَآمَنّا ربَّنا فَاغفِر لنا ذُنوبَنا وكَفِّر عَنّا سَيِّئَاتِنا وتَوَفَّنا مع الأَبرارِ ۝ ربَّنا وآتِنا ما وعَدتَنا على رُسُلِكَ ولا تُخزِنا يَومَ القِيامَةِ إِنَّكَ لا تُخلِفُ الميعادَ﴾
            """,
              repetition: 1,
              note: "سورة آل عمران: آيتا ١٩٣-١٩٤"),
        
        Dhikr(text: """
            ﴿ربَّنا ظَلَمنا أَنفُسَنا وإِن لم تغفِر لنا وتَرحمنا لنكوننَّ مِنَ الخاسِرينَ﴾
            """,
              repetition: 1,
              note: "سورة الأعراف: آية ٢٣"),
        
        Dhikr(text: """
            ﴿ربَّنا لا تَجعَلنا مع القَومِ الظالِمينَ﴾
            """,
              repetition: 1,
              note: "سورة الأعراف: آية ٤٧"),
        
        Dhikr(text: """
            ﴿رَبِّ إِنّي أَعوذُ بك أَن أسألكَ ما لَيسَ لي به عِلمٌ وإِلّا تَغفِر لي وتَرحَمني أَكُن مِنَ الخاسِرينَ﴾
            """,
              repetition: 1,
              note: "سورة هود: آية ٤٧"),
        
        Dhikr(text: """
            ﴿رَبِّ اجعَلني مقيمَ الصَّلاةِ ومن ذُريتي ربَّنا وتقَبَّل دُعاءِ﴾
            """,
              repetition: 1,
              note: "سورة إبراهيم: آية ٤٠"),
        
        Dhikr(text: """
            ﴿رَبَّنَا اغفِر لي ولوالِدَيَّ وللمُؤمنينَ يومَ يقومُ الحِسابُ﴾
            """,
              repetition: 1,
              note: "سورة إبراهيم: آية ٤١"),
        
        Dhikr(text: """
            ﴿رَبِّ زِدني عِلماً﴾
            """,
              repetition: 1,
              note: "سورة طه: آية ١١٤"),
        
        Dhikr(text: """
            ﴿رَبِّ أَعوذُ بِكَ مِن هَمَزاتِ الشَّياطينِ ۝ وَأَعوذُ بِكَ رَبِّ أَن يَحضُرونِ﴾
            """,
              repetition: 1,
              note: "سورة المؤمنون: آية ٩٧-٩٨"),
        
        Dhikr(text: """
            ﴿رَبِّ اغفِر وارحَم وأَنتَ خَيرُ الرّاحِمينَ﴾
            """,
              repetition: 1,
              note: "سورة المؤمنون: آية ١١٨"),
        
        Dhikr(text: """
            ﴿ربَّنا هَبْ لنا من أَزواجنا وذُرياتنا قُرةَ أَعيُنٍ واجعَلنا لِلمُتَّقينَ إِماماً﴾
            """,
              repetition: 1,
              note: "سورة الفرقان: آية ٧٤"),
        
        Dhikr(text: """
            ﴿رَبِّ هَب لي حُكمًا وَأَلحِقني بِالصّالِحينَ ۝ وَاجعَل لي لِسانَ صِدقٍ فِي الآخِرينَ ۝ وَاجعَلني مِن وَرَثَةِ جَنَّةِ النَّعيمِ﴾
            """,
              repetition: 1,
              note: "سورة الشعراء: آية ٨٣-٨٥"),
        
        Dhikr(text: """
            ﴿ولا تُخزِني يَومَ يُبعَثونَ﴾
            """,
              repetition: 1,
              note: "سورة الشعراء: آية ٨٧"),
        
        Dhikr(text: """
            ﴿رَبِّ إِنّي ظَلَمتُ نَفسي فَاغفِر لي﴾
            """,
              repetition: 1,
              note: "سورة القصص: آية ١٦"),
        
        Dhikr(text: """
            ﴿رَبِّ إِنّي لِما أَنزَلتَ إِلَيَّ مِن خَيرٍ فَقيرٌ﴾
            """,
              repetition: 1,
              note: "القصص: آية ٢٤"),
        
        Dhikr(text: """
            ﴿ربَّنا وسِعتَ كُلَّ شَيءٍ رَحمَةً وعِلماً فَاغفِر للذينَ تابوا واتَّبَعوا سَبيلَكَ وقِهِم عَذابَ الجَحيمِ﴾
            """,
              repetition: 1,
              note: "سورة غافر: آية ٧"),
        
        Dhikr(text: """
            ﴿رَبِّ أَوزِعني أَن أَشكُرَ نِعمَتَكَ التي أَنعَمتَ عَلَيَّ وعَلى والدَيَّ وأَن أَعمَلَ صالحاً ترضاهُ وأَصلِح لي في ذُريتي إِنّي تُبتُ إِلَيكَ وإِنّي مِنَ المُسلِمينَ﴾
            """,
              repetition: 1,
              note: "سورة الأحقاف: آية ١٥"),
        
        Dhikr(text: """
            ﴿رَبَّنَا اغفِر لَنا ولِإخواننَا الَّذين سَبَقونا بالإيمانِ ولا تجعَل في قلوبنا غلاً للذينَ آمنوا ربَّنا إِنَّكَ رَءوفٌ رَحيمٌ﴾
            """,
              repetition: 1,
              note: "سورة الحشر: آية ١٠"),
        
        Dhikr(text: """
            ﴿ربَّنا أَتمِم لنا نورَنا واغفِر لنا إِنَّكَ على كلِّ شيءٍ قَديرٌ﴾
            """,
              repetition: 1,
              note: "سورة التحريم: آية ٨")
    ]
